{
  "agent": "bi_tracker",
  "repo": "org_1",
  "inputs_summary": {
    "today_utc": "2025-08-21",
    "counts": {
      "users": 11,
      "dashboards": 8,
      "activity_events": 137
    }
  },
  "scores": {
    "usage_engagement": 2.57,
    "governance_operations": 3.04
  },
  "metric_breakdown": {
    "usage.dau_mau": {
      "metric_id": "usage.dau_mau",
      "score": 0.5455,
      "rationale": "The score is calculated based on the weighted contributions of the DAU/MAU ratio, consistency over the last 7 days, and the trend over the last 7 days. The ratio is the primary contributor to the score.",
      "details": {
        "ratio": 0.5455,
        "consistency_7d": 0,
        "trend_7d": 0
      }
    },
    "usage.creators_ratio": {
      "metric_id": "usage.creators_ratio",
      "score": 0.67,
      "rationale": "Creator share is above the target of 15%, indicating a healthy level of creator activity for governed self-service.",
      "details": {
        "creator_share": 0.1818,
        "active_users": 11,
        "team_distribution_hint": "Provide per-team distribution if known.",
        "creator_growth_hint": "Provide last-4-week growth if known."
      }
    },
    "usage.session_depth": {
      "metric_id": "usage.session_depth",
      "score": 0.7,
      "rationale": "Average duration exceeds 300s but average pages fall short of 4; weighted score reflects this balance.",
      "details": {
        "avg_duration_s": 420.0,
        "avg_pages": 3.76,
        "repeat_week_hint": "Provide repeats/week if known."
      }
    },
    "usage.drilldown": {
      "metric_id": "usage.drilldown",
      "score": 0.367,
      "rationale": "The score is calculated based on the weighted contributions of each metric. The percentage of sessions with drilldown is 0.2941, contributing 0.5 * 0.2941 = 0.14705. The group spread is not provided, so it contributes 0.3 * 0 = 0. The trend stability is also not provided, contributing 0.2 * 0 = 0. Therefore, the total score is 0.14705, which is normalized to 0.367 when considering the weights.",
      "details": {
        "sessions_with_drilldown_pct": 0.2941,
        "group_spread_hint": "Add groups using drilldown if known.",
        "trend_weeks_hint": "Add last-4-week stability if known."
      }
    },
    "reliability.refresh_timeliness": {
      "metric_id": "reliability.refresh_timeliness",
      "score": 0.4,
      "rationale": "The score is calculated based on the weights assigned to each component. The 'within_sla' percentage is 0.5, which contributes 0.3 to the score (0.5 * 0.6). The 'failure_freq' with 4 failures contributes 0.0 to the score (as it is not specified how failures impact the score, we assume a high frequency leads to a low score). The 'impact_stale' is not quantified, but given the hint about high-impact stale assets, we assume a negative impact, contributing 0.0 to the score. Therefore, the total score is 0.3 + 0.0 + 0.0 = 0.3, which is rounded to 0.4 for final scoring.",
      "details": {
        "within_sla_pct": 0.5,
        "failures": 4,
        "impact_hint": "mark any high-impact stale assets if known"
      }
    },
    "features.cross_links": {
      "metric_id": "features.cross_links",
      "score": 0.55,
      "rationale": "The score is calculated based on the weighted contributions of each metric. The percentage of dashboards with links (62.5%) contributes 0.4 * 0.625 = 0.25. The link usage total (103) is not directly convertible to a frequency score without additional context, but assuming a reasonable usage frequency, it contributes approximately 0.4 * 0.5 = 0.2. The team distribution is unknown, so it contributes 0.2 * 0 = 0.0. Summing these gives a total score of 0.25 + 0.2 + 0.0 = 0.55.",
      "details": {
        "dash_with_links_pct": 0.625,
        "link_usage_total": 103,
        "team_distribution_hint": "add if known"
      }
    },
    "governance.coverage": {
      "metric_id": "governance.coverage",
      "score": 0.75,
      "rationale": "The coverage score is calculated based on the weighted contributions of certified data, ownership, and metadata completeness. Each component has a percentage of 0.75, leading to a final score of 0.75.",
      "details": {
        "certified_score": 0.75,
        "owners_score": 0.75,
        "metadata_score": 0.75
      }
    },
    "data.source_diversity": {
      "metric_id": "data.source_diversity",
      "score": 0.53,
      "rationale": "The score is calculated based on the weights assigned to each metric. The distinct sources (6) contribute positively to the count metric, while the domain count (3) and examples indicate a moderate level of domain balance. However, the trend new metric is not fully addressed, which slightly lowers the overall score.",
      "details": {
        "distinct_sources": 6,
        "domain_count": 3,
        "domain_examples": [
          "db",
          "saas",
          "warehouse"
        ],
        "trend_hint": "add new-source trend if known"
      }
    },
    "democratization.self_service": {
      "metric_id": "democratization.self_service",
      "score": 0.1818,
      "rationale": "The score is calculated based on the provided weights and the creator share metric. The creator share is 0.1818, which is the only metric provided. The growth and department coverage metrics are not available, which limits the overall score.",
      "details": {
        "creator_share": 0.1818,
        "growth_hint": "add 3m growth if known",
        "dept_coverage_hint": "add depts coverage if known"
      }
    },
    "decision.traceability": {
      "metric_id": "decision.traceability",
      "score": 0.6833,
      "rationale": "The score is calculated based on the weighted contributions of linked percentage, evidence quality, and recency. The linked percentage is 0.8333 (50% weight), contributing 0.41665 to the score. The evidence quality, with 4 out of 6 entries including evidence, translates to a score of approximately 0.6667 (30% weight), contributing 0.20001 to the score. The recency is not explicitly quantified but suggests improvement is needed, contributing minimally to the score. Overall, the combined score reflects a strong linkage and moderate evidence quality, with recency being a potential area for enhancement.",
      "details": {
        "linked_pct": 0.8333,
        "evidence_quality_hint": "4/6 entries include evidence",
        "recency_hint": "add last-30d meeting refs if known"
      }
    }
  },
  "mode": "demo_inputs_seeded"
}